wintersmith/contents/articles/Java/2014-11-04-about-java.html
---
date: 2014-11-04 20:50:53
template: tech.jade
title: 关于 Java
category: Java
chage_frequency: monthly
tag: Java
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Java</a></li>
<li><a href="#sec-2">应用层技术</a></li>
<li><a href="#sec-3">CS/语言层技术</a></li>
<li><a href="#sec-4">工具链</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-4">
<h4 id="sec-1">Java</h4>
<div class="outline-text-4" id="text-1">


<p>
Java 语言在应用上，是一个工业应用上成熟的语言，生态系统丰富完善。在技术上，Java 语言是基于虚拟机的语言实现、垃圾自动回收管理的典型而成熟的实现。
</p>
<p>
分别从应用层和语言/计算机层进行概览Java的重要技术点，可以作为一个学习和深入的列表。
</p>
</div>

</div>

<div id="outline-container-2" class="outline-4">
<h4 id="sec-2">应用层技术</h4>
<div class="outline-text-4" id="text-2">

<dl>
<dt>数据库交互</dt><dd>JDBC，JTA，JPA
</dd>
<dt>并发编程设计</dt><dd>Executors, Concurrent库，内存模型
</dd>
<dt>Web服务</dt><dd>Servlet规范
</dd>
<dt>模块化设计</dt><dd>OSGI，IOC
</dd>
<dt>热部署</dt><dd>ClassLoader
</dd>
<dt>消息</dt><dd>JMS
</dd>
<dt>连接</dt><dd>JCI
</dd>
<dt>Network</dt><dd>NIO
</dd>
</dl>


</div>

</div>

<div id="outline-container-3" class="outline-4">
<h4 id="sec-3">CS/语言层技术</h4>
<div class="outline-text-4" id="text-3">

<dl>
<dt>外部模块集成/交互</dt><dd>JNI
</dd>
<dt>RPC</dt><dd>RMI
</dd>
<dt>序列化</dt><dd>ObjectStream
</dd>
<dt>元编程</dt><dd>Reflective
</dd>
<dt>泛型</dt><dd>Generaic ，Type parameter
</dd>
<dt>Probe</dt><dd>Instrumentation，AttachAPI
</dd>
<dt>Debug</dt><dd>JMTI，JDI
</dd>
<dt>LVM</dt><dd>JVM, stack based VM, byteCode, Heap, Stack
</dd>
<dt>JIT</dt><dd>C2 , OSR
</dd>
<dt>线程</dt><dd>Thread
</dd>
<dt>同步</dt><dd>Synchronizer, Monitor, ReenterLock, wait, notify, AQS, baise-lock, spin-lock
</dd>
<dt>GC</dt><dd>cms, paraller, mark-sweep, mark-compact, G1, C4, Stop-the-world, Safe Point, Reference, weak-Reference, phatom-Reference, Soft-Reference, GC-Root, tracing-gc
</dd>
<dt>Memory Model</dt><dd>memory visable, voliate, final, memory barrier, happen-befor, re-order, cache-collision
</dd>
<dt>ClassLoad</dt><dd>load-link, classLoader, bootstrap, ext-ClassLoader, AppClassLoader, SystemClassLoader, ContextClassLoader, URLClassLoader, transform, retransform, defineClass, redefineClass
</dd>
<dt>Security</dt><dd>sercurityManager, policy, Permission, Target, Action
</dd>
<dt>Agent</dt><dd>javaagent, agentlib, premain/agentmain, Attach
</dd>
<dt>ByteCode</dt><dd>invokeVirtual, invokeSpecial, invokeDynamic, invokeStatic, Method-signature, Constant-pool, Symbol-table, try-catch
</dd>
<dt>proxy</dt><dd>JDK-dynamic-proxy, cglib-subclass-proxy, aspectj
</dd>
<dt>Instrumentation</dt><dd>javassist, asm
</dd>
</dl>


</div>

</div>

<div id="outline-container-4" class="outline-4">
<h4 id="sec-4">工具链</h4>
<div class="outline-text-4" id="text-4">

<dl>
<dt>Profile</dt><dd>jinfo, jmap, jstack, jperf, MAT, BTrace, jstatd, jconsole, jmx
</dd>
<dt>Package</dt><dd>Jar
</dd>
<dt>Debug</dt><dd>jdb, jdi, jmti, BTrace
</dd>
</dl>




</div>
</div>
